000100* HELLOWORLD.COB
000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID. helloworld.
000400 PROCEDURE DIVISION.
000500     DISPLAY "hello, world".
000600     STOP RUN.

